12/data/attachments/9c1f3d462a74f6ec.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_d687860b-2364-4b89-af16-4ccb3a34a4c6</nif:username>
            <nif:friendToBeAdded>Shane_trip_Friend_18089_6</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>